app/Controllers/Admin.php

    public function authenticate()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $userType = $this->request->getPost('role');

        if (!$userType) {
            return redirect()->back()->with('error', 'Please select user type');
        }

        $adminModel = new AdminModel();

        $admin = $adminModel
            ->where('username', $username)
            ->where('role', $userType)
            ->first();
---
SELECT *
FROM `admins`
WHERE `username` = 'rsk9535'
AND `role` = 'admin'
 LIMIT 1

public function dashboard()
{
    if (!session()->get('is_admin_logged_in')) {
        return redirect()->to('/admin/login');
    }

    if (session()->get('role') !== 'superadmin') {
        return redirect()->to('/member/create');
    }

    $adminModel = new \App\Models\AdminModel();

    $data['admins'] = $adminModel
        ->where('role !=', 'superadmin')
        ->findAll();
---
SELECT *
FROM `admins`
WHERE `role` != 'superadmin'