app/Controllers/Member.php

   public function list()
{
    $search   = $this->request->getGet('q');
    $role     = session()->get('role');
    $username = session()->get('username');

    $builder = $this->memberModel;

    // 🔐 ROLE BASED FILTER
    if ($role !== 'superadmin') {
        $builder = $builder->where('created_by', $username);
    }

    // 🔍 SEARCH
    if ($search) {
        $builder = $builder->groupStart()
                           ->like('customer_id', $search)
                           ->orLike('name', $search)
                           ->groupEnd();
    }

    $data = [
        'members' => $builder->paginate(10),
        'pager'   => $this->memberModel->pager,
        'search'  => $search,
    ];
---
SELECT *
FROM `members`
WHERE `created_by` = 'rsk9535'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `created_by` = 'rsk9535'