app/Controllers/Member.php

SELECT *
FROM `members`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `members`
---
    public function list()
    {
        $search = $this->request->getGet('q');

        $builder = $this->memberModel;

        if ($search) {
            $builder = $builder->like('customer_id', $search)
                               ->orLike('name', $search);
        }

        $data = [
            'members' => $builder->paginate(10),
            'pager'   => $this->memberModel->pager,
            'search'  => $search,
        ];

SELECT *
FROM `members`
WHERE `members`.`id` = '12'
---
    public function edit($id)
    {
        $data['member'] = $this->memberModel->find($id);