app/Controllers/ShareController.php

SELECT `shares`.*, `members`.`name` AS `customer_name`, `members`.`created_by`
FROM `shares`
LEFT JOIN `members` ON `members`.`customer_id` = `shares`.`customer_id`
WHERE `members`.`created_by` = 'rsk9535'
ORDER BY `shares`.`id` DESC
---
    public function index()
{
    $role     = session()->get('role');
    $username = session()->get('username');

    $builder = $this->shareModel->builder();
    $builder->select('shares.*, members.name AS customer_name, members.created_by');
    $builder->join('members', 'members.customer_id = shares.customer_id', 'left');

    // 🔐 ADMIN → only own shares
    if ($role !== 'superadmin') {
        $builder->where('members.created_by', $username);
    }

    $builder->orderBy('shares.id', 'DESC');

    $data['shares'] = $builder->get()->getResultArray();