app/Controllers/ShareController.php

SELECT `customer_id`, `name`
FROM `members`
WHERE `customer_id` LIKE '%CUST%' ESCAPE '!'
OR  `name` LIKE '%CUST%' ESCAPE '!'
 LIMIT 10
---
    public function searchCustomer()
    {
        if (!$this->request->isAJAX()) {
            return;
        }

        $term = $this->request->getGet('term');

        $customers = $this->memberModel
            ->select('customer_id, name')
            ->like('customer_id', $term)
            ->orLike('name', $term)
            ->limit(10)
            ->get()
            ->getResultArray();

SELECT `shares`.*, `members`.`name` AS `customer_name`
FROM `shares`
LEFT JOIN `members` ON `members`.`customer_id` = `shares`.`customer_id`
ORDER BY `shares`.`id` DESC
 LIMIT 10
---
    public function index()
{
    $builder = $this->shareModel->builder();
    $builder->select('shares.*, members.name AS customer_name');
    $builder->join('members', 'members.customer_id = shares.customer_id', 'left');
    $builder->orderBy('shares.id', 'DESC');

    $data['shares'] = $builder
        ->get($this->shareModel->perPage ?? 10)
        ->getResultArray();

SELECT `nominee_name`, `nominee_father`, `nominee_relation`, `nominee_percentage`
FROM `nominees`
WHERE `customer_id` = 'CUST003'
---
 public function getNominees($customerId)
{
    $db = \Config\Database::connect();

    $nominees = $db->table('nominees')
        ->select('nominee_name, nominee_father, nominee_relation, nominee_percentage')
        ->where('customer_id', $customerId)
        ->get()
        ->getResultArray();

SELECT *
FROM `shares`
WHERE `customer_id` = 'CUST003'
 LIMIT 1
SELECT *
FROM `members`
WHERE `customer_id` = 'CUST003'
 LIMIT 1
SELECT *
FROM `nominees`
WHERE `customer_id` = 'CUST003'
---
public function edit($customerId)
{
    // Fetch share using customer_id
    $share = $this->shareModel
        ->where('customer_id', $customerId)
        ->first();

    if (!$share) {
        return redirect()->back()->with('error', 'Share record not found');
    }

    // Fetch customer
    $customer = $this->memberModel
        ->where('customer_id', $customerId)
        ->first();

    // Fetch nominees (linked by customer_id)
    $nominees = $this->nomineeModel
        ->where('customer_id', $customerId)
        ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `shares`
WHERE `customer_id` = 'CUST003'
---
   public function checkShareExists($customerId)
{
    $exists = $this->shareModel
        ->where('customer_id', $customerId)
        ->countAllResults();